<a href="https://colab.research.google.com/github/msheikh1/Week-5-team-project/blob/main/Week_5_Data_Analysis_Team_Project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Data analysis for salaries in san francisco

##Importing libraries and dataset

In [57]:
#Importing our libraries pandas and numpy
import pandas as pd

import numpy as np

In [58]:
#Importing our csv file
df = pd.read_csv("SF_Salary.csv")
#Getting a preview with 3 rows
df.head(3)

   Unnamed: 0    EmployeeName  ... Gender        Pay
0           0  nathaniel ford  ...      m  567595.43
1           1    gary jimenez  ...      m  538909.28
2           2  albert pardini  ...      m  335279.91

[3 rows x 13 columns]

In [59]:
#Deleting the unnamed column
del df["Unnamed: 0"]

##Highest paid employees

In [60]:
#Highest paid employees with their salaries
#In this case we grouped by employee name
#We then we got the max pay of the employees to get the name and salary
df.groupby("EmployeeName").Pay.max().nlargest(5)

EmployeeName
nathaniel ford    567595.43
gary jimenez      538909.28
david shinn       510732.68
amy p             479652.21
william j         436224.36
Name: Pay, dtype: float64

###Highest paid females

In [61]:
#Highest paid females
df[(df.Gender =="f")].groupby("EmployeeName").Pay.max().nlargest(5)

EmployeeName
amy p                 479652.21
joanne m              422353.40
ellen g               415767.94
joanne hayes-white    386807.48
amy hart              376071.59
Name: Pay, dtype: float64

###Highest paid males

In [62]:
#Highest paid males
df[(df.Gender =="m")].groupby("EmployeeName").Pay.max().nlargest(5)

EmployeeName
nathaniel ford    567595.43
gary jimenez      538909.28
david shinn       510732.68
william j         436224.36
gregory p         425815.28
Name: Pay, dtype: float64

##The mean benefits paid

In [63]:
#The mean benefits paid
#We got the mean for the benefits column using .mean() and assigned it to z
#You can then use format then round to round the values to two decimal places
z = df["Benefits"].mean()
format(round(z,2))

'18926.87'

###Mean benefits paid for males and females

In [64]:
#Mean benefits paid for males and females 
#We can compare the benefits for males and females and the average
#We grouped by gender then got the mean for the benefits 
df.groupby("Gender",as_index=False).Benefits.mean()

  Gender      Benefits
0      f  18022.397369
1      m  20301.137266

##Mean base pay

In [65]:
#Mean base pay
#We got the mean for the base pay then we formatted it
x = df["BasePay"].mean()
format(round(x,2))

'66063.72'

###Mean base male and female pay

In [66]:
#We grouped by gender then got the mean for the base pay
df.groupby("Gender",as_index=False).BasePay.mean()

  Gender       BasePay
0      f  63052.231127
1      m  71740.294580

##Average pay per year for all employees

In [67]:
#Average pay per year for all employees
#We grouped by year then we got the mean pay for each year
#In this case we used as_index false just to display in table form as opposed to normal
df.groupby(["Year"],as_index=False).Pay.mean()

   Year            Pay
0  2011   71744.103871
1  2012  100583.308465
2  2013  101452.870647
3  2014  100270.347720

###Average pay per year for males

In [68]:
#Average pay per year for males
#We filtered to get only for males
#We grouped by year then we got the mean pay for each year

df[(df.Gender =="m")].groupby(["Year"],as_index=False).Pay.mean()

   Year            Pay
0  2011   81231.989677
1  2012  111840.148792
2  2013  112517.000832
3  2014  111040.083618

###Average pay per year for females

In [69]:
#Average pay per year for males
#We filtered to get only for males
#We grouped by year then we got the mean pay for each year

df[(df.Gender =="f")].groupby(["Year"],as_index=False).Pay.mean()

   Year           Pay
0  2011  64448.267951
1  2012  92325.481812
2  2013  94429.594821
3  2014  93700.354304

##Average female and male pay

In [70]:
#Average male pay
#We grouped by gender then got the mean pay
df.groupby(["Gender"],as_index=False).Pay.mean()

  Gender            Pay
0      f   86475.670283
1      m  104254.643859

In [71]:
#We got the average male and female pay and assigned them a value
#We then got the average pay and assigned it a value
#We got the difference between the average pay and the average male and female pay
#We then made a comparison
#In the data report more comparisons are made
x = df[(df.Gender == "m")].Pay.mean()
y = df[(df.Gender == "f")].Pay.mean()
z = df.Pay.mean()
print("Men get "+str(x-z)+" more than the mean")
print("Women get "+str(z-y)+" less than the mean")

Men get 10547.873606587047 more than the mean
Women get 7231.099969851784 less than the mean

##Top 5 highest earning jobs

In [72]:
#Top 5 earning jobs
#We grouped by job title. Then we got the mean pay
#We used nlargest then narrowed it to the top 5 

df.groupby("JobTitle").Pay.mean().nlargest(5)

JobTitle
chief investment officer                          436224.360000
chief, fire department                            408865.326667
general manager-metropolitan transit authority    399211.275000
gen mgr, public trnsp dept                        380696.440000
chief of police                                   375797.347500
Name: Pay, dtype: float64

###Top 5 earning jobs for men

In [73]:
#Top 5 highest earning jobs for males
#We filtered gender to males
#We grouped by jobtitle then got the mean pay for each jobtitle
#We used nlargest and narrowed it to the top 5

df[(df.Gender=="m")].groupby("JobTitle").Pay.mean().nlargest(5)

JobTitle
chief investment officer                          436224.3600
general manager-metropolitan transit authority    399211.2750
gen mgr, public trnsp dept                        380696.4400
chief of police                                   375797.3475
dep chf of dept (fire dept)                       362562.2200
Name: Pay, dtype: float64

###Top 5 earning jobs for females

In [74]:
#Top 5 highest earning jobs for females
#We filtered gender to females
#We grouped by jobtitle then got the mean pay for each jobtitle
#We used nlargest and narrowed it to the top 5

df[(df.Gender=="f")].groupby("JobTitle").Pay.mean().nlargest(5)

JobTitle
chief, fire department      408865.326667
assistant deputy chief 2    362306.210000
asst med examiner           352683.254286
dept head v                 349221.598182
adm, sfgh medical center    347079.706667
Name: Pay, dtype: float64

##Top 5 most popular jobs

In [75]:
#Top 5 most popular jobs
#We got the job title then used value count to count the values
#Then used nlargest to get the top 5
df.JobTitle.value_counts().nlargest(5)

transit operator    9424
special nurse       5790
registered nurse    4955
custodian           3214
firefighter         3153
Name: JobTitle, dtype: int64

###Top 5 most popular male jobs

In [76]:
#Top 5 most popular male jobs
#We filtered gender to male
#We got the job title column then used value count to count the number of values which are equal
#We used nlargest to get the top 5 

df[(df.Gender=="m")].JobTitle.value_counts().nlargest(5)

transit operator                5591
firefighter                     2346
deputy sheriff                  1888
police officer 3                1821
public svc aide-public works    1262
Name: JobTitle, dtype: int64

###Top 5 most popular female jobs

In [77]:
#Top 5 most popular female jobs
#We filtered gender to male
#We got the job title column then used value count to count the number of values which are equal
#We used nlargest to get the top 5 

df[(df.Gender=="f")].JobTitle.value_counts().nlargest(5)

special nurse                3108
registered nurse             2592
transit operator             1876
recreation leader            1041
attorney (civil/criminal)     755
Name: JobTitle, dtype: int64

##Comparison between average male pay and average female pay.

In [78]:
#Comparison between average male pay and average female pay.
#The female earnings as compared to male earnings in percentage

#We filtered gender to male then got the mean pay and assigned it to x
x = df[(df.Gender == "m")].Pay.mean()
#We filtered gender to female then got the mean pay and assigned to y
y = df[(df.Gender == "f")].Pay.mean()

(y/x)*100

82.94658835490928

##People with salaries above average

In [79]:
#The total number of people with salaries above average
#We got the people with pay above mean pay
#In this case we used length to count the cells
len(df[df.Pay > df.Pay.mean()])

72991

###Males with salary above average

In [80]:
#Number of males whose salary is above average
#We got the people with pay above mean pay 
#We used the ampersand sign to also get people whose gender is male
#We used length to count the cells
len(df[(df.Pay > df.Pay.mean()) & (df.Gender=='m')])

38667

###Females with salary above average

In [81]:
#Number of females whose salary is above average
#We got the people with pay above mean pay 
#We used the ampersand sign to also get people whose gender is female
#We used length to count the cells
len(df[(df.Pay > df.Pay.mean()) & (df.Gender=='f')])

22438